package p1;

public class App {
    public static void main(String[] args) {
        // 클래스에 대한 키워드들 : *****일상생활에서 코딩할 때 적용하기 ****
        // 캡슐화(정보의 은닉) >> 직관적으로 생각하면 public이나 private이냐 물어보는것
        // 응집도
        // *** SRP(단일 책임 원칙) >> 역할을 최대한 나누자라는 느낌정도로 받아들이면 좋음 >> 기능의 세분화
        // >> 메서드와 클래스의 기능에 대해 자세하게 계속 세분화할 수 있음 >> 보통 메서드 부터 뜯다가 클래스 까지 뜯게됨됨
        // 추상화
        // 일반화 (추상화랑 개념적으로 비슷함)

        String str = "안녕하세요";

    }
}

// 인스턴스 메서드일때 this키워드가 안붙어있으면 쓸모가 없는것
// STM Class V2 App에 해당내용 적어놨음
